Repository: 84000/data-translation-memory
Catalog: toh129-v4.tmx
Source language: bo
Languages: en

source: དབྱངས་ཀྱི་ཡན་ལག་གི་ཚུལ་གྱི་གཟུངས་ལ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to engage in dhāraṇīs through the diverse aspects of melodious speech.

source: སྐད་ཐམས་ཅད་བྲག་ཅའི་སྐད་དང་མཚུངས་པ་ཉིད་དུ་ཤེས་པ་དང་།
en: It is to know all sounds to be like echoes.

source: ཅི་རིགས་པར་ཆོས་སྟོན་པ་དང་སེམས་ཅན་ཐམས་ཅད་ལ་ལེགས་པར་བཤད་པས་ཚིམ་པར་བྱེད་པ་དང་།
en: “It is to teach the Dharma according to need. It is to satisfy all beings by providing them with good advice.

source: དབང་པོ་རྗེ་བ་ཤེས་པ་དང་དུས་དང་དུས་མ་ཡིན་པར་རྣམ་པར་ལྟ་བ་དང་།
en: It is to know how to change faculties. It is to discern whether the time is ripe or not.

source: ཡང་དག་པའི་མཐའ་དང་རྗེས་སུ་འཇུག་པ་ཤེས་པ་དང་། འབྲས་བུ་ཡོད་པའི་ཆོས་སྟོན་པ་དང་
en: It is to know how to be in accord with the limit of reality. It is to teach Dharma that gives results.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་དང་།
en: It is to complete all the perfections.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ་དང་།
en: It is to hold all beings dear.

source: ཚར་གཅོད་པ་མཁས་པར་ཤེས་པ་དང་
en: It is to skillfully know how to defeat.

source: བརྟགས་པ་མ་ཡིན་པའི་སྤྱོད་ལམ་དང་ལྡན་པ་དང་།
en: It is to have deportment that is uncontrived.

source: ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་པར་ཡང་དག་པར་འདུ་བ་ལ་འཇུག་པ་ཤེས་པ་དང་
en: It is to know how to authentically unite with the realm of phenomena without mixing anything up.

source: རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པ་དང་།
en: It is to put an end to thought, conceptualization, and mental constructions.

source: སྐད་ཅིག་གིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་ལུས་སྟོན་པ་དང་།
en: “It is to manifest one’s body at the feet of all thus-gone ones in an instant.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་མིག་ཡོར་ལྟ་བུའི་ལུས་རྣམ་པར་འཕྲུལ་པ་དང་།
en: It is to emanate bodies like optical illusions in all world systems.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཐམས་ཅད་བསྟན་པ་ཀུན་ཏུ་འཛིན་ཅིང་བརྗེད་པ་མེད་པ་དང་།
en: It is to uphold and never forget any of the Dharma teachings of all the thus-gone ones.

source: ཐེག་པ་ཆེན་པོ་ལས་མི་ཉམས་པ་དང་ཐེག་པ་ཐམས་ཅད་ཀྱི་ངེས་པར་འབྱུང་བ་སྟོན་པ་ལ་མཁས་པ་དང་།
en: It is to never slide back from the Great Vehicle. It is to be skilled in teaching emancipation according to each vehicle.

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་ཡང་དག་པར་འཛིན་པ་དང་།
en: It is to authentically uphold the lineage of the Three Jewels.

source: སྐྱེ་བའི་གནས་ཐམས་ཅད་དུ་བྱ་བ་ཅི་རིགས་པར་ཀུན་ཏུ་སྟོན་པ་དང་།
en: It is to show actions appropriate to each and every birthplace.

source: ཕྱི་མའི་མཐའི་བསྐལ་པ་བྱེ་བར་གོ་ཆ་གྱོན་ཀྱང་ཡོངས་སུ་མི་སྐྱོ་བ་དང་།
en: It is to never grow discouraged even though one has to wear the armor for millions of eons, until the end of time.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ལ་མཁས་པར་ཤེས་པ་དང་།
en: It is to skillfully know how to ripen all beings.

source: དབྱངས་ཀྱི་ཡན་ལག་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པ་ཤེས་པ་དང་།
en: “It is to know how to accomplish all aspects of melodious speech.

source: བསྐལ་པ་གཅིག་བསྐལ་པ་གྲངས་མེད་པ་ལ་འཇུག་པ་ཤེས་པ་དང་། ཆོས་ཐམས་ཅད་ལ་མངོན་པར་འབྱུང་བའི་གནས་ཤེས་པ་དང་ཞིང་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་ལ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to make one eon last for limitless eons.

source: བསྐལ་པ་གྲངས་མེད་པ་བསྐལ་པ་གཅིག་ལ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know the ground of manifestation within all phenomena.

source: ཞིང་གཅིག་ཞིང་ཐམས་ཅད་དུ་སྟོན་པ་ཤེས་པ་དང་
en: It is to know how to gather all buddha realms together.

source: སེམས་ཅན་གཅིག་གི་ལུས་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཡང་དག་པར་འདུ་བ་ལ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to gather all beings’ bodies into a single being’s body.

source: སྐྲ་ཙམ་གྱི་ཁྱོན་གཅིག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་བསམ་གྱིས་མི་ཁྱབ་པ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to bring inconceivable buddha realms into the space of a single hair’s breadth.

source: རང་གི་ལུས་ཀྱི་སྤུའི་ཁུང་བུའི་ཕྱོགས་གཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད་པ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to bring innumerable, inconceivable, immeasurable world systems into just a single pore of one’s body.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནམ་མཁའ་དང་མཚུངས་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་ཅིང་ཤེས་པ་དང་།
en: It is to understand all buddha realms to be equivalent to space.

source: རང་གི་ལུས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པ་ཐམས་ཅད་རྒྱས་པར་དགང་བ་ཤེས་པ་དང་།
en: It is to know how to fill each and every buddha realm to the brim with one’s own body.

source: ཆོས་ཐམས་ཅད་མཚན་ཉིད་མེད་པར་རྟོགས་པར་ཤེས་པ་ལ་མཁས་པར་ཤེས་པ་དང་།
en: It is to skillfully understand and realize how all phenomena are without characteristics.

source: ལུས་ཐམས་ཅད་ལ་ལུས་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to inhabit all bodies.

source: སྐད་གཅིག་བརྗོད་པས་སྐད་ཐམས་ཅད་ངེས་པར་སྒྲོག་པ་ཤེས་པ་དང་།
en: It is to know how to speak precisely in all languages while speaking in one language.

source: ཐབས་མཁས་པ་ཐམས་ཅད་ཀྱི་ཚུལ་རྟོགས་པར་ཤེས་པ་དང་།
en: It is to realize all the ways to be skilled in means.

source: ཚིག་གཅིག་ལས་བརྩམས་ཏེ་བསྐལ་པ་བྱེ་བ་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད་པ་སྟོན་པ་ཤེས་པ་དང་།
en: It is to know how to teach a single word for innumerable, inconceivable, immeasurable millions of eons.

source: སྤོབས་པ་རྒྱུན་མི་འཆད་པ་དང་
en: It is to have unceasing eloquence.

source: སྒྲུབ་པ་དང་མི་སྒྲུབ་པ་ཤེས་པ་ལ་རྣམ་པར་དཔྱོད་པ་དང་།
en: It is to be discerning in knowing what to accomplish and what to let be.

source: ཕྲུགས་དང་ཆ་དང་སྣྲེལ་ཞིའི་འབྱེད་པ་བསྟན་པ་ཤེས་པ་དང་།
en: It is to know how to show the distinctions between dyads, parts, and inversions.

source: ཐབས་དང་ཤེས་རབ་ཆེན་པོའི་འོད་ཟེར་རབ་ཏུ་གཏོང་བ་ཤེས་པ་དང་།
en: “It is to know how to emit the light of great means and insight.

source: བདུད་ཀྱི་ལམ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདའ་བ་ཤེས་པ་དང་།
en: It is to know how to transcend all the paths of Māra. I

source: ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཀྱི་སྔོན་དུ་ཡེ་ཤེས་འགྲོ་བ་དང་།
en: t is to have one’s actions of body, speech, and mind preceded by wisdom.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞིས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཚིམ་པར་བྱེད་ཅིང་།
en: It is to fulfill all the realms of beings with the four types of correct understanding.

source: བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པས་རྫུ་འཕྲུལ་ཐོབ་པ་དང་།
en: It is to attain miraculous abilities through creating merit.

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་རྣམ་པར་འཕྲུལ་པ་ཀུན་ཏུ་སྟོན་པ་དང་།
en: t is to reveal emanations throughout the entire realm of phenomena.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་རྣམས་ཀྱི་བརྗོད་པ་ཁོང་དུ་ཆུད་པ་དང་།
en: It is to understand the utterances of beings in all world systems.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་ཐམས་ཅད་བསྡུ་བའི་དངོས་པོ་བཞིས་སྡུད་པ་དང་།
en: It is to gather all beings throughout all the world systems in the ten directions together through the four ways of attracting disciples.

source: སྒྱུ་མ་ལྟ་བུའི་ཆོས་སྒྲུབ་པ་ལ་ཐེ་ཚོམ་མེད་པ་དང་།
en: It is to have no doubt about accomplishing qualities, which are like illusions.

source: ཡོ་བྱད་ལ་དབང་ཐོབ་པ་དང་སྐྱེ་བ་ཐམས་ཅད་ལ་དབང་ཐོབ་པ་ཡོངས་སུ་རྫོགས་པ་དང་།
en: It is to bring to consummation the attainment of power over requisites and over all births.

source: ཚུལ་ཁྲིམས་འཆལ་པ་དང་ཚུལ་ཁྲིམས་དང་ལྡན་པ་མཚུངས་པ་སྦྱིན་པའི་གནས་སུ་སེམས་པ་ཤེས་པ་དང་།
en: It is to know how to equally attend to those with corrupted morality and those with pure morality as recipients of generosity.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཆོས་དང་ལྡན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་
en: It is to make the thoughts of all beings adhere to the Dharma.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྤུའི་ཁུང་བུ་གཅིག་གི་འོད་ཟེར་གྱི་དྲ་བས་ཁེབས་པར་བྱེད་པ་དང་།
en: It is to cover all the world systems in the ten directions with a web of light from a single pore.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གསང་བ་ཐོབ་པ་དང་།
en: It is to attain the secrets of all bodhisattvas.

source: མཚོ་ཆེན་པོ་རྒྱ་མཚོའི་གཏིང་ཚོད་ཡངས་པ་ཤེས་པ་དང་།
en: “It is to know the vast depth of the great ocean.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་འོད་ཟེར་ཆེན་པོའི་དྲ་བ་རབ་ཏུ་གཏོང་བ་ཤེས་པ་དང་།
en: It is to know how to send forth a massive web of light into all the world systems in the ten directions.

source: སེམས་ས་དང་ཆུ་དང་མེ་དང་རླུང་དང་མཉམ་པ་དང་།
en: It is to have a mind that is equal to earth, water, fire, and wind.

source: དེ་བཞིན་གཤེགས་པའི་ས་ལ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to enter the level of the thus-gone ones.

source: ཚིག་དང་ངེས་པའི་ཚིག་བསྟན་པ་ཐམས་ཅད་ལ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་དང་མ་བསྟན་པར་རང་གིས་བཟོད་པ་ཐོབ་པ་ཤེས་པ་དང་།
en: It is to know how to turn the wheel of Dharma in all explanations of words and etymologies and to know how to attain patience by oneself without being taught.

source: སྤུའི་ཁུང་བུ་གཅིག་ནས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་རྒྱ་མཚོའི་ཆུའི་ཕུང་པོ་རབ་ཏུ་འཐོར་བ་ཤེས་ཤིང་སེམས་ཅན་ལ་ཆུས་གནོད་པ་ཡང་མེད་པ་དང་།
en: It is to know how to make burst forth from a single pore the mass of water of the oceans in all the world systems in the ten directions without harming any being with the water.

source: སེམས་རིན་པོ་ཆེ་ལྟ་བུ་དང་
en: It is to have a jewel-like mind.

source: ཉོན་མོངས་པའི་དྲི་མ་ཐམས་ཅད་སེལ་བ་ཤེས་པ་དང་།
en: It is to know how to dispel all the stains of the disturbing emotions.

source: དགེ་བའི་རྩ་བ་དང་བསོད་ནམས་ཚད་མེད་པ་སོགས་པ་དུས་གསུམ་དུ་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པའི་ཆོ་ག་ཤེས་པ་དང་།
en: It is to know how to skillfully be content in dedicating the limitless roots of virtue and merit accumulated in the three times.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པས་དབུགས་འབྱིན་པ་འཐོབ་པ་དང་།
en: It is to find relief by awakening to all the qualities of a buddha.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་སྤྲུལ་པའི་བྱིན་གྱི་རླབས་ཤེས་པ་དང་།
en: “It is to know how to bring emanations into the mental activity of all beings.

source: སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ཐམས་ཅད་ལ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to engage in the entire experience of buddhahood.

source: རང་གི་སྨོན་ལམ་རྒྱུན་མི་གཅོད་ཅིང་སེམས་ཅན་ཉེ་བར་འཛིན་པའི་སྤྱོད་པའི་བྱིན་གྱིས་བརླབ་པ་ཀུན་ཏུ་སྟོན་པ་ཤེས་པ་དང་།
en: It is to have an unbroken continuity of aspirations and to know how to manifest the conduct that draws beings near.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ལ་རྣམ་པར་ལྟ་བ་མངོན་སུམ་དུ་ཤེས་པ་དང་།
en: It is to directly know how to see the wisdom of the thus-gone ones.

source: དེ་བཞིན་གཤེགས་པའི་གསང་བ་ལ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to engage in the secrets of the thus-gone ones.

source: སེམས་ཞི་ཞིང་རབ་ཏུ་ཞི་ལ་ཉེ་བར་ཞི་བ་དང་འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་དགའ་བ་དང་།
en: It is to have a mind that is tranquil, being calm and at peace, and to bring delight to all beings in order to properly train others.

source: རྩེ་བ་དང་ལོངས་སྤྱོད་ཐམས་ཅད་ཀུན་ཏུ་བསྟན་པ་ཤེས་པ་དང་།
en: It is to know how to demonstrate playfulness and enjoyment.

source: ཐོས་པ་ཚད་མེད་པ་འཛིན་པ་ཡང་དག་པར་རྫོགས་པ་དང་ཐོས་པ་ཐམས་ཅད་ཀྱིས་མི་ངོམས་ཤིང་མི་ཆོག་ལ་རྒྱུན་མི་གཅོད་པ་དང་།
en: It is to be consummate in possessing limitless learning and to never be content or satisfied with all one’s learning.

source: ཆོས་ཐམས་ཅད་མི་དམིགས་པ་དང་འཇིག་རྟེན་གྱི་བྱ་བ་དང་། ཚུལ་སྣ་ཚོགས་ལ་འཇུག་པ་དང་
en: “It is to not apprehend any phenomena. It is to engage in worldly activity in many different ways.

source: འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱིས་མི་གོས་པ་དང་།
en: It is to not be corrupted by any worldly phenomena.

source: འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་།
en: It is to ripen beings through proper training.

source: ལྐུགས་པ། རྣ་མི་གསང་བ། གྲུམ་པོ། བླུན་པོ། འོན་པ། ལོང་བ་ཐམས་ཅད་ལ་སྤྱོད་ལམ་ཀུན་ཏུ་སྟོན་པ་དང་།
en: It is to show correct behavior to those whose speech is impaired, those whose hearing is impaired, and those who are disabled, dull-minded, deaf, or blind.

source: བསྐལ་པ་གྲངས་མེད་པ་སེ་གོལ་གཅིག་གཏོགས་པ་སྲིད་དུ་བྱིན་གྱིས་རློབ་ཅིང་ཆོས་སྟོན་པ་ཤེས་པ་དང་།
en: It is to know how to teach the Dharma and transform countless eons into the duration of a single finger snap.

source: བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་ཟིལ་གྱིས་མནན་པའི་ཕྱིར་ལག་ན་རྡོ་རྗེ་བརྒྱ་སྟོང་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད་དཔག་ཏུ་མེད་ཚད་མེད་པ་ཕྱི་བཞིན་འབྲང་བ་དང་།
en: “It is to be followed by innumerable, inconceivable, immeasurable, infinite, and limitless hundreds of thousands of Vajrapāṇis that outshine Śakra, Brahmā, and the guardians of the world.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དབུལ་པོ་དང་སྡུག་ཕོངས་པ་བྱིན་གྱིས་རློབ་པ་དང་།
en: It is to bless the poor and destitute in order to ripen beings.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་རང་འབྱུང་གི་ཡེ་ཤེས་ལ་ལྟ་བ་ལ་མངོན་སུམ་དུ་ཤེས་པ་དང་།
en: It is to directly know the view of self-arising wisdom, which is the awakening of all buddhas.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྱོད་ལམ་ཀུན་ཏུ་སྟོན་པ་དང་
en: It is to show the conduct of all hearers and solitary buddhas.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་བྱིན་གྱིས་རློབ་པ་ཤེས་པ་དང་།
en: It is to know how to manifest turning the irreversible wheel of Dharma in all the world systems in the ten directions.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་མཚུངས་པ་མེད་གཞལ་དུ་མེད་དེ། ཚད་མེད་པའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་བསྟན་པ་ཐོགས་པ་མེད་པ་ཤེས་པ་དང་།
en: It is to know how to unimpededly teach, with a single moment of thought, for as many quadrillions of eons as there are atoms in innumerable, inconceivable, incomparable, immeasurable, and limitless world systems in order to ripen all beings.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཁ་དོག་དང་སྤྱོད་ལམ་བསྐལ་པར་ཀུན་ཏུ་སྟོན་པ་དང་།
en: It is to show the appearance and conduct of all hearers and solitary buddhas for eons.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་རྒྱུན་མི་གཅོད་པ་དང་།
en: It is to be unceasing in the complete bodhisattva conduct in order to ripen beings.

source: བསམ་གཏན་མཁའ་ཁྱབ་ལ་བསམ་གཏན་བྱེད་པ་དང་།
en: It is to practice all-pervading mental stability.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འཁོར་ལྷའི་བུ་མོ་གླུ་ལེན་ཅིང་རོལ་མོའི་དབྱངས་སྒྲ་དང་། སིལ་སྙན་སྣ་ཚོགས་དང་ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་ལེན་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་འགྲོ་བ་ཤེས་པ་དང་།
en: It is to know how, in order to ripen beings, to move among the retinues of all the thus-gone ones throughout all the limitless world systems while surrounded by divine maidens singing songs and playing accompanying instruments, various cymbals, and drums, with a chorus numbering in the quadrillions.

source: གནས་གང་ནས་ཀྱང་གཡོ་བ་མེད་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བལྟ་ཞིང་བསྙེན་བཀུར་བྱ་བ་དང་།
en: It is to behold and honor all the thus-gone ones, without ever leaving one’s seat.

source: མཆོད་པའི་ལས་རྒྱུན་མི་གཅད་པ་ཤེས་པ་དང་
en: It is to know how to make offerings unceasingly.

source: སེམས་ཅན་མཐའ་ཡས་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་མཐོང་བ་དང་ཐོས་པ་དོན་ཡོད་པ་འདོད་ཅིང་གནས་པ་དང་།
en: It is to seek and abide in unfailing vision and hearing in order to ripen limitless beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་རྣམས་ཇི་ལྟ་བ་བཞིན་དུ་གདུལ་བའི་ཕྱིར་སེམས་ཀྱིས་སྐད་ཅིག་ལ་དགའ་ལྡན་གྱི་གནས་ན་གནས་པ་དང་འཆི་འཕོ་བ་དང་སྐྱེ་བ་དང་མངོན་པར་འབྱུང་བ་དང་། དཀའ་བ་སྤྱོད་པ་ཀུན་ཏུ་སྟོན་པ་དང་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་། བདུད་འདུལ་བ་ཀུན་ཏུ་སྟོན་པ་དང་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཀུན་ཏུ་སྟོན་པ་ནས་ཇི་ཙམ་དུ་དམ་པའི་ཆོས་གནས་པ་དང་། ནུབ་པའི་བར་ཕྱོགས་བཅུ་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཀུན་ཏུ་སྟོན་པ་ཡང་ཤེས་ལ། ཤིན་ཏུ་མངོན་པར་རྫོགས་པར་ཡང་འཚང་མི་རྒྱ་བ་སྟེ།
en: It is to know how, in order to guide ripened beings appropriately, to demonstrate, in one single instant of thought, abiding in the Heaven of Joy, dying and transmigrating, taking birth, leaving the palace, undergoing austerities, going to the seat of awakening, taming Māra, awakening, turning the wheel of Dharma, passing into the great transcendence of suffering, and letting the sacred Dharma remain from that point on until it declines, and to demonstrate all this as many times as there are atoms in all the world systems in the ten directions while forgoing the attainment of complete awakening.

source: བཟང་སྐྱོང་འདི་ནི་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།། །།
en: This, Bhadrapāla, is the absorption of the miraculous ascertainment of peace.

source: བཟང་སྐྱོང་ཏིང་ངེ་འཛིན་འདིའི་ཡོངས་སུ་སྦྱངས་པ་བྱ་བ་གང་ཞེ་ན།
en: “Bhadrapāla, you may wonder what the practice of this absorption is like.

source: བཟང་སྐྱོང་གང་ཡང་ཀུན་ཏུ་མི་འཛིན་པ། མི་འདོར་བ། མི་འཇོག་པ།
en: Well, Bhadrapāla, it is to not grasp at anything, not reject anything, and not engage with anything.

source: འདུ་བྱེད་ཐམས་ཅད་རབ་ཏུ་ཞི་བ།
en: It is to pacify all formations.

source: ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པ།
en: It is to understand all phenomena as they are.

source: ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ལ་འཇུག་པ།
en: It is to engage in the sameness of all phenomena.

source: ཆོས་ཐམས་ཅད་ལ་མི་རྟོག་པ།རྣམ་པར་མི་རྟོག་པ། རྣམ་པར་མི་སྒྲུབ་པ།
en: It is to not conceptualize, reflect on, or establish any phenomena.

source: ཀུན་ནས་མི་སློང་བ།མི་སྐྱེད་པ།
en: It is to not generate or produce anything.

source: རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་ཀུན་ཏུ་རྟོག་པ་ཡང་དག་པར་གཅོད་པ།
en: It is to eliminate all concepts, thoughts, and reflections.

source: སེམས་ཀྱི་དམིགས་པ་ཡིད་ལ་མི་བྱེད་པ།
en: It is to be without mental engagement that involves objectification.

source: རྣམ་པར་ཤེས་པ་ཡང་དག་པར་གཅོད་པ།
en: It is to eliminate consciousness.

source: འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་ཡང་དག་པར་གཅོད་པ།
en: It is to eliminate desire, anger, and delusion.

source: མཐའ་དང་མཐའ་མེད་པ་ཡིད་ལ་མི་བྱེད་པ།
en: It is to be without mental engagement concerned with both the limited and the limitless.

source: ཡིད་ལ་བྱེད་པ་ཡང་དག་པར་གཅོད་པ།
en: It is to eliminate all mental engagement.

source: ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ཀྱི་རང་བཞིན་ཤེས་པ།
en: It is to know the nature of the aggregates, the elements, and the sense sources.

source: དྲན་པ་དང་བློ་གྲོས་དང་མོས་པ་དང་རྟོག་པ་དང་། ངོ་ཚ་ཤེས་པ་དང་སྤྱོད་པ་དང་ཆོ་ག་དང་། སྤྱོད་ཡུལ་ལ་ནན་ཏན་དུ་བྱེད་ཅིང་གནས་པ།
en: It is to be mindful, intelligent, interested, contemplative, and conscientious, as well as to be ardent in observing proper conduct, ritual, and livelihood.

source: ཉོན་མོངས་པ་མེད་པའི་ས་དང་ལྡན་པ།ཞི་བའི་ས་དང་ལྡན་པ།
en: It is to be on the level of no disturbing emotions and the level of peace.

source: སྤྲོས་པ་ཐམས་ཅད་ཡང་དག་པར་གཅོད་པ།
en: It is to eliminate all conceptual proliferation.

source: བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ཐམས་ཅད་དང་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ཐམས་ཅད་དང་། ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་འགྲུབ་པ་
en: It is to actualize all trainings of the bodhisattvas, the entire domain of the thus-gone ones, and all virtuous qualities.

source: འདི་ནི་བཟང་སྐྱོང་ཏིང་ངེ་འཛིན་འདིའི་ཡོངས་སུ་སྦྱང་བ་བྱའོ།
en: Bhadrapāla, such is the practice of this absorption.

source: །བཟང་སྐྱོང་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ལ་སེམས་ཤིང་ཆོས་དཔྱོད་པ་ཡིན་ཏེ།དེས་ནི་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྐུར་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ན་ཆོས་ཀྱི་སྐུ་ལས་གཞན་དུའང་དམིགས་པ་ལྟ་ཅི་སྨོས།
en: “Bhadrapāla, even though bodhisattvas reflect on and analyze the Dharma, they still do not perceive the Thus-Gone One in his Dharma body, let alone observe him in other ways apart from the Dharma body.

source: བཟང་སྐྱོང་འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་འདི་ལྟར་སོ་སོར་བརྟག་པར་བྱ་སྟེ།དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་ཚིག་འདིའི་དོན་ཇི་ལྟ་བུ།
en: “Bhadrapāla, bodhisattvas should investigate by thinking, ‘What is meant by “Thus-Gone One”?

source: ཅི་གཟུགས་དེ་བཞིན་གཤེགས་པ་ཡིན་ནམ།འོན་ཏེ་གཟུགས་ལས་གཞན་ཞིག་དེ་བཞིན་གཤེགས་པ་ཡིན་སྙམ་དུ་དེ་ལྟར་དཔྱོད་པ་ལ་མཁས་པར་བྱའོ།
en: Is the Thus-Gone One form, or is the Thus-Gone One something other than form?’ They should be skilled in such investigations.

source: །དེ་འདི་ལྟར་སོ་སོར་རྟོག་སྟེ།གཟུགས་ཀྱང་དེ་བཞིན་གཤེགས་པ་མ་ཡིན་ལ།གཟུགས་ལས་གཞན་པ་ཡང་མ་ཡིན་ནོ།
en: They should think, ‘The Thus-Gone One is not form, but also not other than form.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: And why?

source: གཟུགས་ནི་བེམས་པོ་གཡོ་བ་མེད་པ། དཔྱོད་པ་མེད་པ།རྩྭ་དང་། རྩིག་པ་དང་། ཤིང་དང་། བོང་བ་དང་།
en: Well, form is inanimate, unmoving, and unable to reason—like hay, bricks, wood, and soil.

source: མིག་ཡོར་ལྟ་བུར་ངན་པ།དབུ་བ་རྡོས་པ་ལྟ་བུ་ཡིན་ཞིང་།
en: Form is deceptive like an optical illusion—it is like a mass of foam.

source: འབྱུང་བ་ཆེན་པོ་བཞི་ཕན་ཚུན་ནས་བསྡུས་པ་ནི་གཟུགས་ཞེས་བྱའོ།
en: What we call form is an aggregation of the four great elements.

source: །གཟུགས་ནི་རྟེན་ཅིང་འབྲེལ་པ་ལས་འབྱུང་ངོ་།
en: Form arises dependently.

source: །གང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དེ་མི་རྟག་པའོ།
en: Whatever arises dependently is impermanent.

source: །གང་མི་རྟག་པ་དེ་སྡུག་བསྔལ་བའོ།
en: Whatever is impermanent is suffering.

source: །གང་སྡུག་བསྔལ་བ་དེ་བདག་མེད་པའོ།
en: Whatever is suffering has no self.

source: །གང་བདག་མེད་པ་དེ་རང་བཞིན་མེད་པའོ།
en: Whatever has no self has no intrinsic nature.

source: །གང་རང་བཞིན་མེད་པ་དེ་སྣང་བ་མེད་པའོ།
en: Whatever has no intrinsic nature has no appearance.

source: །གང་སྣང་བ་མེད་པ་དེ་ཡང་དག་པ་མ་ཡིན་པའོ།
en: Whatever has no appearance is not genuine.

source: །གང་ཡང་དག་པ་མ་ཡིན་པ་དེ་བརྫུན་པ་སླུ་བའི་ཆོས་སོ།
en: Whatever is not genuine is a false and deceptive phenomenon.

source: །གང་བརྫུན་པ་སླུ་བའི་ཆོས་དེ་མི་བདེན་པའོ།
en: Whatever is a false and deceptive phenomenon is not true.

source: །གང་མི་བདེན་པ་དེ་དེ་བཞིན་ཉིད་མ་ཡིན་ནོ།
en: Whatever is not true is not suchness.

source: །གང་དེ་བཞིན་ཉིད་མ་ཡིན་པ་དེ་དེ་བཞིན་གཤེགས་པ་མ་ཡིན་ནོ།
en: Whatever is not suchness is not the Thus-Gone One.

source: །དེ་བཞིན་གཤེགས་པ་ནི་བདེན་པ། ཡང་དག་པ།དེ་བཞིན་ཉིད་མ་ནོར་བ་དེ་བཞིན་ཉིད།གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད། མ་ལོག་པ་བདེན་པ་སྨྲ་བ།ཡང་དག་པ་སྨྲ་བ།ཤེས་པ་སྨྲ་
en: “ ‘The Thus-Gone One is true, genuine, unmistaken suchness, nothing but suchness, non-erroneous suchness, a speaker of unerring truth, a speaker of reality, a speaker of knowledge,

source: བ།ཡེ་ཤེས་ཀྱི་མཚོན་ཆ་ཅན།ཡེ་ཤེས་མཐའ་ཡས་པ་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ། ཐམས་ཅད་གཟིགས་པ། སྟོབས་བཅུ་དང་ལྡན་པ།
en: one who holds the weapon of wisdom, one who possesses limitless wisdom, an omniscient one, an all-seeing one, one with ten powers,

source: མི་འཇིགས་པ་བཞི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོབ་པ།
en: one who has attained the perfection of the four highest types of fearlessness,

source: མི་རྟོག་པ་རྣམ་པར་མི་རྟོག་པ།
en: one without thoughts and concepts,

source: མི་གོས་པ།
en: one without stains,

source: ནམ་མཁའ་དང་མཚུངས་པ།
en: one who is equal to the sky,

source: གྲངས་ཀྱི་ཆོས་རྣམས་ཀྱིས་མི་འགྲངས་པ།
en: and one who cannot be sized up by calculations.

source: མ་བྱས་པ། མ་སྐྱེས་པ། མ་འགགས་པ།
en: The Thus-Gone One is not made, not born, not ceasing,

source: འཇུག་པ་མེད་པ། མཐའ་ཡས་པ། གནས་མེད་པ། རྣམ་པར་མི་རིག་པ། རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་པ། ཀུན་ཏུ་རྒྱུ་བ་མེད་པ།
en: without engagement, limitless, without abode, without cognition, beyond apprehension, without movement,

source: ཤིན་ཏུ་དག་པ། ཉོན་མོངས་པ་མེད་པ། མ་བྱུང་བ། སྤྱོད་པ་མེད་པ། གནས་མེད་པའོ་སྙམ་མོ།
en: utterly pure, free from disturbing emotions, not arising, without action, and non-abiding.’

source: །དེ་འདི་ལྟར་སོ་སོར་རྟོག་སྟེ། གཟུགས་དེ་བཞིན་གཤེགས་པ་མ་ཡིན།གཟུགས་ལས་གཞན་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “The bodhisattvas should continue to analyze, ‘Form is not the Thus-Gone One, yet neither is the Thus-Gone One other than form. And why?

source: གལ་ཏེ་གཟུགས་ལས་གཞན་པ་ཞིག་དེ་བཞིན་གཤེགས་པ་ཡིན་ན་ནི་ནམ་མཁའ་ཡང་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ།
en: If something that was other than form were the Thus-Gone One, then the sky would also be the Thus-Gone One.

source: ནམ་མཁའ་ནི་གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ། ཐོགས་པ་མེད་པ། རྣམ་པར་མི་རིག་པ། གནས་པ་མེད་པ། གཟུང་དུ་མེད་པ། གནས་མེད་པ། མཚན་ཉིད་མེད་པའོ་སྙམ་མོ།
en: Because the sky does not have form, it cannot be demonstrated, it is unimpeded, it does not cognize, it does not abide, it cannot be grasped, it has no abode, and it has no characteristics.’

source: །དེ་འདི་ལྟར་སོ་སོར་རྟོག་སྟེ། གལ་ཏེ་གཟུགས་དེ་བཞིན་གཤེགས་པ་མ་ཡིན། གཟུགས་ལས་གཞན་པ་ཡང་མ་ཡིན་ན།
en: “The bodhisattvas should continue to contemplate, ‘Form is not the Thus-Gone One, yet neither is the Thus-Gone One other than form.

source: ཅི་ཚོར་བ་དེ་བཞིན་གཤེགས་པར་འགྱུར་རམ།
en: So perhaps feeling is the Thus-Gone One?

source: འོན་ཏེ་ཚོར་བ་ལས་གཞན་པ་ཞིག་སྙམ་མོ།
en: Or is the Thus-Gone One other than feeling?’
